{
    "description": "Вы не можете бороться с тем, чего не знаете, и, кажется, никто ничего не знает о том, кто такая Призрак или как она может делать то, что может. В криминальном мире ее боятся и восхищаются ее способностью проходить сквозь твердые стены, истинные намерения Призрака так же неуловимы, как и она сама, хотя одно можно сказать наверняка: она заинтересована в том, чтобы заполучить все технологии Пима, которые она сможет найти. Ее передовые технологии в сочетании с ее боевым мастерством делают ее силой, с которой нужно считаться.​",
    "youtube": "r4-wJeKkvVw",
    "gameplay": {
        "description": "Рывок назад\nНачните фазирование в течение 2 секунд. Фазирование не активируется, если на Призрака действует ослабление пробития брони или пассивный эффект точности.\n\nФазирование  \n- При переходе в фазу вы получаете пассивный эффект точности на 6 секунд, который гарантирует, что следующий удар будет критическим, и расходует пассивный эффект точности. Призрак может наносить критические удары только благодаря своим способностям.\n- Во время фазирования входящие атаки имеют 100% шанс промахнуться, а каждое ослабление постепенного урона на Призраке преобразуется в пассивный эффект ярости, повышающий рейтинг атаки на 1294 на 5 секунд.\n- Фазирование немедленно деактивируется, когда Призрак инициирует атаку или блокирует атаку."
    },
    "attack": {
        "description": "- От критических ударов нельзя уклониться.\n- Некритические удары с вероятностью 10% вызывают усиление жестокости, повышающее рейтинг критического урона на 1333,33 на 20 секунд. Усиления жестокости складываются до 5.\n- Когда противник уклоняется, получает пассивную точность на 6 секунд.",
        "heavy": "50% шанс вызвать ярость, повышающую вашу атаку на 647 на 10 секунд. Чем дольше заряжается тяжелая атака, тем больше шанс получить усиление жестокости при тяжелом некритическом ударе."
    },
    "specials": {
        "1": {
            "description": "Призрачный удар — Призрак проводит серию точных атак, прежде чем перейти к удару ногой сальто назад.",
            "note": "Получите 3 пассивных умения точности на 6 секунд. При срабатывании сразу после перехода в фазу каждое попадание является гарантированным критическим."
        },
        "2": {
            "description": "Использование слабости — Призрак застает противника врасплох ударами ногой в грудь, заканчивающимися ударом сверху.",
            "note": "Получите усиление жестокости, повышающее показатель критического урона на 1333,33 на 20 секунд, затем обновите все усиления жестокости, созданные Призраком. При срабатывании сразу после перехода в фазу каждое попадание является гарантированным критическим."
        },
        "3": {
            "description": "Беспощадный натиск — Призрак наступает на противника, быстро приближаясь и отступая, уклоняясь от его атак и парируя свои собственные.",
            "note": "Каждое усиление жестокости, созданное Призраком, преобразуется в постоянное пассивное усиление жестокости. Пассивные эффекты жестокости складываются до 5."
        }
    },
    "signature": {
        "description": "Квантовая аугментация — улучшенная технология дает Призраку больший контроль над фазированием. Она начинает бой Фазированием, и пока оно активно, пропущенные атаки противника дают ей Силу.",
        "note": "В начале боя начните Фазирование на 2 секунды. Когда противники промахиваются, генерируйте 5% от максимальной силы за каждый промах."
    },
    "author": {
        "name": "Kabam",
        "type": "spotlight",
        "profile": "https://playcontestofchampions.com/news/champion-spotlight-ghost/"
    }
}