{
  "description": "When a nearby experimental gamma reactor went into meltdown, Gail Williams made the impossible choice to dive into the flaming wreckage and save her abusive foster father. In doing so, she showed her compassion, courage and fortitude and became the champion of two Divine Spirits, Brother Grizzly and Sister Eagle. The two spirits bestowed upon her their might, knowledge and healing gifts. Now she works to save those in need, even the gamma mutates cursed by The One Below All, as the hero Chee’ilth!",
  "gameplay": {
    "sections": [
      {
        "name": "Oppose The One Below All",
        "description": "While fighting #Gamma Opponent’s, Chee’ilth’s personal Debuffs gain 40% potency and her Synergy Bonuses gain special [Gamma] enhancements.",
        "note": "#Gamma is a new tag being introduced in 41.3. It refers to the Heroes and Villains of the Marvel universe who draw their power from gamma radiation, such as Hulk, Abomination, and even Sasquatch."
      },
      {
        "name": "Personal Debuffs",
        "description": "As an Attacker, personal Debuffs gain 30% duration.\n\nAs a Defender, personal Debuffs can be inflicted through Block.",
        "note": "Keep an eye on Chee’ilth’s Debuffs on Defense, otherwise you’ll find yourself taking a lot of chip damage from her Bleed Debuffs being inflicted through Block."
      },
      {
        "name": "Spirit Charges – Max: 10",
        "description": "Every 20 seconds, Sister Eagle and Brother Grizzly bestow an indefinite Spirit Charge on Chee’ilth. As a Defender, this timer becomes 10 seconds.\n\nWhen this timer expires, as well as at the start of each fight, Sister Eagle grants 2 indefinite Cleanse Passives. Max: 10.\n\nBrother Grizzly grants +143.6 Critical Damage Rating and +15% Bleed potency per Spirit Charge.",
        "note": "The Cleanse gained at the start of the fight cannot clear away any Debuffs that are also gained at the same time, such as Liquid Courage or Double Edge."
      },
      {
        "name": "Sister Eagle the Healer – Blocking",
        "description": "While Blocking the Opponent’s attacks, their Attack Rating is capped at 100% of what it was at the start of the fight.\n\nWell-Timed Blocks reduce this Attack Rating cap to 50%. Each Well-Timed Block also shortens the Spirit Charge timer by 5 seconds.",
        "note": "This effect means that no matter how much Attack Rating the Opponent has gained throughout the fight, Chee’ilth will always block for the same amount of damage. Keep in mind that this only accounts for Attack Rating gained after the fight has started, so Buff Nodes, Boosts and Mastery Bonuses will still increase the amount of damage the opponent can deal."
      },
      {
        "name": "Brother Grizzly the Warrior – Attacking",
        "description": "Chee’ilth’s Bleed Debuffs deal 2162.48 Direct Damage over 9 seconds.\n\nStriking the Opponent with the Adze Axe inflicts a Bleed Debuff.\n\nBrother Grizzly shortens the Spirit Charge timer by 7 seconds each time Chee’ilth Punishes a Heavy Attack or Special Attack.",
        "note": "Chee’ilth uses her Adze Axe during her Medium Attacks, Heavy Attack, and Special Attacks."
      },
      {
        "name": "Special Attack 2 – wa7 saq̓w ti pqúsa (The Eagle Soars)",
        "description": "The final hit inflicts a non-stacking Eagle’s Tranquilize Debuff for 12 seconds which counts as a 50% Tranquilize Debuff. While Eagle’s Tranquilize is active, Chee’ilth cannot Miss. Each time a Debuff or Miss is prevented, pause Eagle’s Tranquilize for 3 seconds.",
        "note": "Eagle’s Tranquilize prevents Miss from activating entirely, and reduces the Opponent’s Debuff Ability Accuracy by 50%. With the effect being paused for 3 seconds each time one of these two effects are prevented, Chee’ilth is very capable of keeping Eagle’s Tranquilize active during match-ups with a lot of Miss or Debuff abilities. Eagle’s Tranquilize can also be used to build up Cleanse Charges in Debuff heavy fights."
      },
      {
        "name": "Special Attack 3 – nəpštəwmɛtuwum qʷal (They Come to War)",
        "description": "This attack can only be used once per fight.\n\nGain an indefinite 35% Vicious Passive.\n\nGain a 15 second Regeneration Buff, healing 50% of Health lost this fight or 30% of missing Health, whichever is greater.",
        "note": "Choosing the right time to launch a Special 3 is very important to Chee’ilth. Launching it early grants her a 35% increase to her Bleed Damage while using it later can be very helpful in shoring up any chip damage that may have slipped past her block."
      }
    ],
    "abilities": [
      "cleanse",
      "eagle’stranquilize",
      "grizzly’sgrit",
      "bleed"
    ]
  },
  "specials": {
    "1": {},
    "2": {},
    "3": {}
  },
  "signature": {
    "name": "χɛmamɛn (Claw of the Bear)",
    "description": "Brother Grizzly extends his wisdom, granting a Precision Passive each time the Opponent is Immune to a Bleed effect, increasing Critical Rating by 1211.54 for 10 seconds. While Chee’ilth has at least one of these Precision Passives, they can land Critical Hits through Block.\n\nSister Eagle also provides new assistance, instantly healing 90% of all damage dealt to Chee’ilth by Physical Damage effects.",
    "note": "To gain the Precision Passive, the opponent has to avoid a Bleed effect entirely. This means that Purifying or removing the Bleed after it activates will not grant a Precision Passive.Physical Damage effects refers to Physical Damage from abilities like Rupture or bursts of Physical Damage caused by Champions like Red Hulk. It does not count Physical Damage from attacks."
  },
  "author": {
    "name": "Kabam",
    "type": "spotlight",
    "profile": "https://playcontestofchampions.com/news/cheeilth/"
  },
  "attack": {
    "sections": [
      {
        "name": "Heavy Attacks",
        "description": "Punishing a Heavy Attack or Special Attack pauses all personal Debuffs on the Opponent for 5 seconds.\n\nThe final hit of this attack inflicts 2 additional Bleed Debuffs.",
        "note": "The first hit of this attack covers a lot of distance, allowing Chee’ilth to weave Heavy Attacks into the fight more smoothly."
      },
      {
        "name": "Special Attack 1 – ts7as lhláku7 ku st̓alhálem (There’s a Grizzly Coming)",
        "description": "On activation, gain a Grizzly’s Grit Passive for 16 seconds which counts as a Grit Passive. While Grizzly’s Grit is active, all attacks gain a 50% chance to inflict a Bleed Debuff.",
        "note": "Grit is a new ability that allows your attacks to strike Unstoppable Opponent’s as if they weren’t Unstoppable. Grizzly’s Grit also grants all attacks a chance to inflict Bleed, meaning Adze Axe Attacks can inflict multiple Bleeds in a single strike."
      }
    ]
  }
}