{
  "description": "Rising from under the canopy of a mysterious alien forest, Groot, the invincible master of plants and King of Planet X conquers all! This savage and ferocious monster from a parallel universe never met Rocket or joined the Guardians, instead becoming a galactic warlord and experimenting on captured humans. But now, the ruthless King’s mission has been interrupted by the Collector, and he has set his sights on a new goal: hoarding all of the abundant treasure and power The Contest has to offer!",
  "gameplay": {
    "description": "Always Active\nUnique physiology grants Immunity to Bleed, Power Drain and Power Burn effects.\n\nPersonal Fury Buffs\nUnless otherwise stated, King Groot’s Fury Buffs each provide +501 Attack Rating and last 13 seconds.\nWhenever King Groot receives a Debuff, he will spend 1 personal Fury Buff after 0.5 seconds to Purify that Debuff.\n\nMalice – Passive\nKing Groot starts the fight with a Malice Passive, which grants 3 Fury Buffs each time it activates. Malice lasts as long as King Groot has at least 1 Personal Fury Buff remaining.\nWhile Malice is active: Gain up to +100% Fury Buff Potency based on how long the fight has gone on. Max Bonus after 100 seconds.\nWhen Malice ends, it goes on Cooldown for 13 seconds.\n\nWhile Malice is on Cooldown – Passive\nAny attack from either Champion has a 20% chance to grant 1 Fury Charge. When Cooldown ends, gain 1 Fury Buff for each Charge acquired and re-enter Malice.\nEach time King Groot’s attack is Evaded, Auto-Blocked, or Misses gain 2 Fury Charges. Cooldown 3 seconds."
  },
  "specials": {
    "1": {
      "description": "Inflicts up to 3 Armor Break Debuffs, with each having a 100% chance to activate, removing an Armor Up Buff and reducing Armor Rating by 286.36 for 15 seconds. Max Stacks: 10. These Armor Breaks also reduce future Armor Up Buff Potency by 10%.\nMalice: Spend 1 Fury Buff to make the Armor Break indefinite.",
      "name": "Floral Ferocity"
    },
    "2": {
      "description": "Each hit of King Groot’s caustic breath deals 1169 direct damage. This damage is tripled against #Robot Champions.\n100% chance to inflict a Poison Debuff, reducing healing effects by 30% and dealing 3340 direct damage over 10 seconds.\nMalice: Spend 1 Fury Buff to increase the Poison duration by 100%",
      "name": "Internal Toxicity"
    },
    "3": {
      "description": "100% chance to gain a Regeneration Buff, recovering 10% Health over 3 seconds. This Regeneration Buff is Paused while King Groot is Heal Blocked.\nMalice: Spend 1 Fury Buff to increase the Buff duration by 50%.",
      "name": "Savagery Unleashed"
    }
  },
  "signature": {
    "name": "Unyielding Might",
    "description": "Malice – Passive\nWhile Malice is active: Gain up to +100% Poison duration based on how long the fight has gone on. Max Bonus after 100 seconds.\nWhen Malice enters Cooldown, gain a Regeneration Buff, recovering 7572.69 Health over 13 seconds."
  },
  "attack": {
    "heavy": "Pause all Poison and Armor Break Debuffs on the opponent for 3 seconds.\nMalice: Spend 1 Fury Buff to instead Pause for 6 seconds."
  },
  "author": {
    "name": "Kabam",
    "type": "spotlight",
    "profile": "https://playcontestofchampions.com/news/champion-spotlight-king-groot/"
  }
}