{
  "description": "Working as an enforcer for organized crime in Las Vegas, the dark incarnation of the Hulk named Joe Fixit is morally ambiguous at best, and downright cruel at worst. Dressed impeccably in his trademark suits, Mr. Fixit enjoys the finer things in life, like money, women, gambling, and gunning down his enemies with his dual Tommy Guns. He may be a weaker version of the Hulk, but he more than makes up for it with his firepower and sinister intelligence.",
  "gameplay": {
    "sections": [
      {
        "name": "Always Active",
        "description": "An enhanced Immune system provides full Immunity to the Poisons of the Battlerealm.",
        "note": ""
      },
      {
        "name": "Gambler’s Draw",
        "description": "Joe Fixit can hold 4 cards at a time. At max capacity, new cards replace old cards in the same order they were acquired.\n\nCards are drawn even if the attack was blocked.\n\nHearts: End Combo with Light, +7% Life Steal.\n\nSpades: End Combo with Medium, +1601.6 Attack Rating.\n\nClubs: Heavy Hit, +25% Combat Power Rate.\n\nDiamonds: Well-Timed Block, +25% Block Penetration.\n\nWhen Defending a Quest Node, cards are acquired based on the Attacking Champions actions.",
        "note": "Mix and match, what’s the best combo you can find to get the freshest cup of Joe going!"
      },
      {
        "name": "Dead Man’s Hand – On Special Activation",
        "description": "If Joe’s hand consists of one of the following combinations, inflict the respective Debuff for 10 seconds. +5 seconds per bar of Power spent.\n\nOne Pair: Disorient, reducing Defensive Ability Accuracy and Block Proficiency by 40%.\n\nThree of a Kind: Weakness, reducing Attack Rating by 30%.\n\nFlush: Petrify, reducing Ability Power Rate and Regeneration Rate by 60%.\n\nPlaying a hand removes all cards on the last hit of the Special Attack.",
        "note": "Joe’s got a brand new suite of utility, defenders aren’t going to want to catch these hands!"
      }
    ],
    "abilities": [
      "disoriented",
      "weakness",
      "petrify"
    ]
  },
  "specials": {
    "1": {
      "name": "Place Your Bets",
      "description": "On Hit, 50% chance to Inflict a Bleed Debuff dealing 1401.4 Direct Damage over 10 seconds. +1 per Dead Man’s Hand Debuff.",
      "note": "Stack some MASSIVE Bleed damage with Joe. That Tommy Gun is no joke! How many Bleeds can you get going?",
      "damagetypes": [
        "physical"
      ],
      "abilities": [
        "bleed"
      ]
    },
    "2": {
      "name": "Shorten the Odds",
      "description": "The final hit has a 100% chance to inflict a 2.75 second Stun Debuff.\n\nReplay the last Dead Man’s Debuff that was played.",
      "abilities": [
        "stun"
      ],
      "note": "Great for utility, and stacking the hand you want! Use this when you have a specific Defender that requires a bit more finesse than a Tommy Gun can dish out."
    },
    "3": {
      "description": "Inflict a random Dead Man’s Hand Debuff.\n\nUntil the Opponent is no longer suffering any Dead Man’s Hand Debuffs, Gambler’s Draw card effects have +30% Potency.",
      "abilities": [
        "bleed"
      ],
      "name": "The House Always Wins"
    }
  },
  "signature": {
    "name": "Stacked Deck",
    "description": "Always Active\n\nAfter using cards to play a Dead Man’s Hand Debuff, instead of being removed, all slots are randomly assigned 1 matching suit.\n\nAdditionally, suits gain a stackable bonus during Special Attacks.\n\nHearts: +10% Debuff Duration.\n\nSpades: +748.4 Critical Rating.\n\nClubs: 30.04% of a bar of Power over 2 seconds.\n\nDiamonds: +24.96% Armor Penetration.\n\nJackpot: Counts as all 4 Suits.",
    "note": "Once those jackpots start rolling in, Joe will start rolling through fights!"
  },
  "author": {
    "name": "Kabam",
    "type": "spotlight",
    "profile": "https://playcontestofchampions.com/news/champion-spotlight-joe-fixit/"
  },
  "youtube": "lmUiwTSD-UM"
}