{
  "description": "When an ancient evil, lurking for eons, is released from its shackles, the Asgardian God of Thunder is thrown into a whirlwind of chaos. Ripped from his familiar surroundings and stripped of his powers, Thor’s only hope is to summon the warrior within, and fight his way back against impossible odds. With his kingdom shattered and his people in dire need, Thor must discover what it means to be a true leader.",
  "gameplay": {
    "sections": [
      {
        "name": "Always Active – Shock Effects",
        "description": "Incoming Shock effects suffer 90% duration.\n\nEach time Thor inflicts a Shock Debuff he has a 16% chance to also inflict a Stun Debuff lasting 2 seconds.\n\nEach time Thor inflicts a Shock Debuff he has a 45% chance to inflict an Armor Break Debuff, removing an Armor Up Buff and reducing Armor Rating by 964.29 for 10 seconds.",
        "note": ""
      },
      {
        "name": "Boon of the Gods",
        "description": "Each time Thor gains 40 hits on his Combo Meter, or is struck 20 times he gains a Boon of the Gods Passive. Max: 2 stacks.\n\nBoon of the Gods fills Thor’s Power Meter over 6 seconds and is unaffected by Ability Accuracy reductions.\n\nIf Thor is struck by a Special Attack, Boon of the Gods is removed.",
        "note": "We’ve changed the Boon of the gods to count down now instead of counting up, so be careful when he gets close to 0!"
      },
      {
        "name": "When the Opponent Intercepts Thor’s Dash",
        "description": "30% chance to Auto-Block the attack. This Block is considered Well-Timed and can activate the Parry Mastery.",
        "note": ""
      },
      {
        "name": "When an Attack Inflicts a Stun",
        "description": "If the opponent has an Armor Break Debuff, the attack deals a burst of additional Physical Damage equal to 250% of the damage dealt by the attack.",
        "note": "Spamming Special 1 will help you trigger this often for a TON of damage!"
      }
    ],
    "abilities": [
      "stun",
      "armorbreak",
      "shock"
    ]
  },
  "specials": {
    "1": {
      "description": "75% chance to inflict a 1.8 second Stun Debuff.\n\nIf at a Combo Meter of 40+ chance is instead 100%.",
      "note": "45% chance to Stun for 1.8 seconds, plus 55% chance if a Combo of 40 or more hits is maintained",
      "abilities": [
        "stun"
      ],
      "name": "Fearsome Fighter"
    },
    "2": {
      "description": "100% chance to inflict an Armor Break Debuff, removing 1 Armor Up Buff and reducing Armor Rating by 1500 for 16 seconds.\n\nThis Armor Break Debuff is Paused while Boon of the Gods is active.",
      "note": "Breaks the opponent’s Armor, applying 1333 Armor Rating reduction for 10 seconds.",
      "name": "The Warrior Within"
    },
    "3": {
      "description": "This attack cannot deal more than 20% of the opponent’s Max Health in damage. This damage cap is increased to 30% if the opponent is suffering from an Armor Break Debuff.\n\n100% chance to inflict a Shock Debuff, causing 4435.2 Energy Damage over 10 seconds.\n\n100% chance to gain a Thunder God’s Wrath Passive lasting 30 seconds which is unaffected by Ability Accuracy Reductions. While active, contact with the opponent has a 40% chance to inflict a Shock Debuff, causing 3326.4 Energy Damage over 5 seconds.",
      "note": "Shocks the opponent, dealing 540 Energy Damage over 5 seconds. This Special Attack can only inflict up to maximum of 20% of the opponent’s max Health as damage.",
      "abilities": [
        "shock"
      ],
      "name": "God of Thunder"
    }
  },
  "signature": {
    "description": "Always Active\n\nThunder God’s Wrath is enhanced to provide +3614.77 Attack Rating.\n\nAdditionally, each Shock Debuff on the opponent causes them to suffer -20% Ability Accuracy.",
    "note": "Gain a ton of bonus damage with this new and improved sig ability!",
    "name": "Renewed Spark"
  },
  "author": {
    "name": "Kabam",
    "type": "spotlight",
    "profile": "https://playcontestofchampions.com/news/champion-spotlight-thor-ragnarok/"
  },
  "youtube": "oD1cfq4ex8Q"
}